app/controllers/categories_controller.rb

	def index
		@categories = Category.where(parent_id: nil)
---
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL

	def new
		@category = Category.new
		@categories = Category.where(parent_id:nil)
---
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL

	def create
		@category = Category.new(params[:category])
		@categories = Category.where(parent_id:nil)
		if @category.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL
INSERT INTO "categories" ("created_at", "name", "parent_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 22 Dec 2013 20:10:35 UTC +00:00], ["name", "country"], ["parent_id", 1], ["updated_at", Sun, 22 Dec 2013 20:10:35 UTC +00:00]]

	def destroy
		@category = Category.find(params[:id])
		if @category.delete
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "categories" WHERE "categories"."id" = 3