app/controllers/products_controller.rb

	def index
		@products = Product.search(params[:search])
---
SELECT "products".* FROM "products"

	def show
		# debugger
		# @categories = Category.where(parent_id:nil)
		@product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "2"]]

	def create
		@categories = Category.where(parent_id:nil)
		@product = Product.new(params[:product])
		# debugger
		if @product.save
---
INSERT INTO "products" ("created_at", "description", "image", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "price", "product_name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"