app/views/categories/index.html.haml

          = link_to "Edit", edit_category_path(category), :class => 'btn btn-mini',:remote => true
          - category.sub_categories.each do |subcategory|
---
SELECT "categories".* FROM "categories"